# CC-YOLO: EMA + CISA at P3 + P2 detection head
nc: 29
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2  P2/4  ← P2跳跃连接
  - [-1, 1, Conv, [256, 3, 2]]          # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4  P3/8  ← P3跳跃连接
  - [-1, 1, Conv, [512, 3, 2]]          # 5  P4/16
  - [-1, 2, C3k2, [512, True]]          # 6  P4/16 ← P4跳跃连接
  - [-1, 1, Conv, [1024, 3, 2]]         # 7  P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8  P5/32
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

head:
  # ── 自顶向下：P5 → P4 → P3 → P2 ──
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12 融合P4
  - [-1, 2, C3k2, [512, False]]                 # 13 P4特征

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15 融合P3
  - [-1, 2, C3k2, [256, False]]                 # 16 P3特征
  - [-1, 1, EMA, [256]]                         # 17 EMA注意力
  - [-1, 1, CISA, [256]]                        # 18 CISA注意力

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 19 上采样到P2尺度
  - [[-1, 2], 1, Concat, [1]]                   # 20 融合P2 backbone特征
  - [-1, 2, C3k2, [128, False]]                 # 21 P2检测特征 ← 新增检测头

  # ── 自底向上：P2 → P3 → P4 → P5 ──
  - [-1, 1, Conv, [128, 3, 2]]                  # 22 下采样
  - [[-1, 18], 1, Concat, [1]]                  # 23 融合P3（EMA+CISA后）
  - [-1, 2, C3k2, [256, False]]                 # 24 P3检测特征

  - [-1, 1, Conv, [256, 3, 2]]                  # 25 下采样
  - [[-1, 13], 1, Concat, [1]]                  # 26 融合P4
  - [-1, 2, C3k2, [512, False]]                 # 27 P4检测特征

  - [-1, 1, Conv, [512, 3, 2]]                  # 28 下采样
  - [[-1, 10], 1, Concat, [1]]                  # 29 融合P5
  - [-1, 2, C3k2, [1024, True]]                 # 30 P5检测特征

  - [[21, 24, 27, 30], 1, Detect, [nc]]         # 检测头：P2/P3/P4/P5四个尺度